# Algèbre relationnels

In [1]:
import numpy as np
import pandas as pd

In [8]:
ser = pd.Series([1,2,3], index=['a','b','c'])

In [5]:
data = [{'a' : i,'b' : 2*i} for i in range(3)]
type(data)

list

In [6]:
df=pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [7]:
df

   a  b
0  0  0
1  1  2
2  2  4

In [9]:
ser.loc['b']

2

In [10]:
ser.b

2

In [12]:
# On peut même créer une Serie directement à partir d'une dict
area = pd.Series({'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135})
pop = pd.Series( {'California': 423967, 
             'Texas': 695662,
             'New York': 141297, 
             'Florida': 170312,
             'Illinois': 149995})
data = pd.DataFrame({'area':area, 'pop':pop})

In [13]:
data

                area     pop
California  38332521  423967
Texas       26448193  695662
New York    19651127  141297
Florida     19552860  170312
Illinois    12882135  149995

In [20]:
data.loc['California',:'pop']

area    38332521
pop       423967
Name: California, dtype: int64

# Concatenation

In [23]:
# Une fonction pour générer facilement des DataFrame. 
# Elle nous sera utile dans la suite de ce chapitre.
def make_df(cols, ind):
    """Crée rapidement des DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

In [24]:
make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [27]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
df3=make_df('AB',[5,6])

In [26]:
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [28]:
df1.append(df3)

    A   B
1  A1  B1
2  A2  B2
5  A5  B5
6  A6  B6

In [29]:
df1

    A   B
1  A1  B1
2  A2  B2

In [30]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [A, B]
Index: []